
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>聚类分析 · Notes</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Kitty">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-base16-ateliersulphurpool.light.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-ace/ace.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="fen-lei-1-0.html" />
    
    
    <link rel="prev" href="guan-lian-fen-xi.html" />
    

    
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://www.norris-niu.top" target="_blank" class="custom-link">Return to Blog</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../esl-reading-notes.html">
            
                <a href="../esl-reading-notes.html">
            
                    
                        <b>1.2.</b>
                    
                    ESL Reading Notes
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../esl-reading-notes/chapter-2.html">
            
                <a href="../esl-reading-notes/chapter-2.html">
            
                    
                        <b>1.2.1.</b>
                    
                    Chapter 2
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../esl-reading-notes/chapter-3.html">
            
                <a href="../esl-reading-notes/chapter-3.html">
            
                    
                        <b>1.2.2.</b>
                    
                    Chapter 3
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../shu-ju-wa-jue-dao-lun.html">
            
                <a href="../shu-ju-wa-jue-dao-lun.html">
            
                    
                        <b>1.3.</b>
                    
                    数据挖掘导论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="shu-ju.html">
            
                <a href="shu-ju.html">
            
                    
                        <b>1.3.1.</b>
                    
                    数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="guan-lian-fen-xi.html">
            
                <a href="guan-lian-fen-xi.html">
            
                    
                        <b>1.3.2.</b>
                    
                    关联分析
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.3" data-path="ju-lei-fen-xi.html">
            
                <a href="ju-lei-fen-xi.html">
            
                    
                        <b>1.3.3.</b>
                    
                    聚类分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="fen-lei-1-0.html">
            
                <a href="fen-lei-1-0.html">
            
                    
                        <b>1.3.4.</b>
                    
                    分类1.0
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="fen-lei-2-0.html">
            
                <a href="fen-lei-2-0.html">
            
                    
                        <b>1.3.5.</b>
                    
                    分类2.0
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="emsuan-fa.html">
            
                <a href="emsuan-fa.html">
            
                    
                        <b>1.3.6.</b>
                    
                    EM算法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../leetcode-answer.html">
            
                <a href="../leetcode-answer.html">
            
                    
                        <b>1.4.</b>
                    
                    Leetcode Answer
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../leetcode-answer/array.html">
            
                <a href="../leetcode-answer/array.html">
            
                    
                        <b>1.4.1.</b>
                    
                    Array
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="../leetcode-answer/array/remove-element.html">
            
                <a href="../leetcode-answer/array/remove-element.html">
            
                    
                        <b>1.4.1.1.</b>
                    
                    Remove Element
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="../leetcode-answer/array/remove-duplicates-from-sorted-array.html">
            
                <a href="../leetcode-answer/array/remove-duplicates-from-sorted-array.html">
            
                    
                        <b>1.4.1.2.</b>
                    
                    Remove Duplicates from Sorted Array
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" data-path="../leetcode-answer/array/plus-one.html">
            
                <a href="../leetcode-answer/array/plus-one.html">
            
                    
                        <b>1.4.1.3.</b>
                    
                    Plus One
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="../leetcode-answer/array/pascals-triangle.html">
            
                <a href="../leetcode-answer/array/pascals-triangle.html">
            
                    
                        <b>1.4.1.4.</b>
                    
                    Pascal's Triangle
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.5" data-path="../leetcode-answer/array/merge-sorted-array.html">
            
                <a href="../leetcode-answer/array/merge-sorted-array.html">
            
                    
                        <b>1.4.1.5.</b>
                    
                    Merge Sorted Array
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../macpei-zhi-si-ren-zhi-nan.html">
            
                <a href="../macpei-zhi-si-ren-zhi-nan.html">
            
                    
                        <b>1.5.</b>
                    
                    MAC配置私人指南
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >聚类分析</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="1&#x805A;&#x7C7B;&#x6982;&#x8FF0;"><a name="1&#x805A;&#x7C7B;&#x6982;&#x8FF0;" class="plugin-anchor" href="#1&#x805A;&#x7C7B;&#x6982;&#x8FF0;"><i class="fa fa-link" aria-hidden="true"></i></a>1.&#x805A;&#x7C7B;&#x6982;&#x8FF0;</h1>
<p>&#x805A;&#x7C7B;&#x662F;&#x4EC0;&#x4E48;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x7B80;&#x5355;&#x901A;&#x4FD7;&#x7684;&#x8BF4;&#x5C31;&#x662F;&#x5C06;&#x6570;&#x636E;&#x5206;&#x6210;&#x6709;&#x610F;&#x4E49;&#x6216;&#x6709;&#x7528;&#x7684;&#x7EC4;&#xFF08;&#x7C07;&#xFF09;&#xFF0C;&#x80FD;&#x591F;&#x53CD;&#x6620;&#x51FA;&#x6570;&#x636E;&#x7684;&#x81EA;&#x7136;&#x7ED3;&#x6784;&#x3002;&#x805A;&#x7C7B;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x662F;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;&#x3001;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x4E00;&#x79CD;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x3002;&#x751F;&#x7269;&#x5B66;&#x4E2D;&#x7684;&#x754C;&#x95E8;&#x7EB2;&#x76EE;&#x79D1;&#x5C5E;&#x79CD;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x5C42;&#x6B21;&#x5316;&#x805A;&#x7C7B;&#xFF0C;&#x5C06;&#x6742;&#x4E71;&#x65E0;&#x7AE0;&#x7684;&#x5BA2;&#x6237;&#x4FE1;&#x606F;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x7EC4;&#x4EE5;&#x5B9E;&#x65BD;&#x4E0D;&#x540C;&#x7684;&#x4FC3;&#x9500;&#x624B;&#x6BB5;&#x90FD;&#x662F;&#x805A;&#x7C7B;&#x7684;&#x5E94;&#x7528;&#x3002;&#x805A;&#x7C7B;&#x7684;&#x4F5C;&#x7528;&#x5927;&#x4F53;&#x6765;&#x8BF4;&#x5206;&#x4E3A;&#xFF1A;</p>
<ol>
<li><p>&#x6C47;&#x603B;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x6C47;&#x603B;&#x6BD4;&#x65B9;&#x8BF4;PCA&#x3001;SVD&#xFF0C;&#x4F46;&#x662F;&#x9762;&#x5BF9;&#x6570;&#x636E;&#x7279;&#x522B;&#x590D;&#x6742;&#x7684;&#x65F6;&#x5019;&#x662F;&#x65E0;&#x6CD5;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x7B80;&#x4FBF;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4F8B;&#x5982;&#x805A;&#x7C7B;&#x65B9;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x538B;&#x7F29;&#x3002;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x5E38;&#x5E38;&#x7528;&#x4E8E;&#x56FE;&#x50CF;&#x3001;&#x58F0;&#x97F3;&#x3001;&#x89C6;&#x9891;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4ED6;&#x4EEC;&#x6570;&#x636E;&#x7279;&#x70B9;&#x90FD;&#x662F;&#xFF1A;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x76F8;&#x4F3C;&#x5EA6;&#x8F83;&#x9AD8;&#xFF1B;&#x67D0;&#x4E9B;&#x4FE1;&#x606F;&#x7684;&#x4E22;&#x5931;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#xFF1B;&#x5E0C;&#x671B;&#x53D1;&#x5E45;&#x5EA6;&#x538B;&#x7F29;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x6709;&#x6548;&#x53D1;&#x73B0;&#x6700;&#x90BB;&#x8FD1;&#x3002;&#x5148;&#x627E;&#x5230;&#x90BB;&#x8FD1;&#x7684;&#x7C07;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4ECE;&#x90BB;&#x8FD1;&#x7684;&#x7C07;&#x4E2D;&#x9009;&#x62E9;&#x90BB;&#x8FD1;&#x7684;&#x70B9;&#x3002;</p>
</li>
</ol>
<p>&#x524D;&#x9762;&#x901A;&#x4FD7;&#x7684;&#x8BF4;&#x4E86;&#x805A;&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x4EC5;&#x6839;&#x636E;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x53D1;&#x73B0;&#x7684;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x4EE5;&#x53CA;&#x5176;&#x5173;&#x7CFB;&#x4FE1;&#x606F;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x5206;&#x7EC4;&#x3002;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x5C06;&#x4F7F;&#x5F97;&#x7EC4;&#x5185;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5F88;&#x5927;&#xFF0C;&#x800C;&#x7EC4;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5F88;&#x5C0F;&#x3002;</p>
<p>&#x805A;&#x7C7B;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x591A;&#x79CD;&#x591A;&#x6837;&#x7684;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x5B9A;&#x4E49;&#x9700;&#x8981;&#x533A;&#x5206;&#xFF1A;</p>
<ol>
<li><p>&#x5C42;&#x6B21;&#x7684;&#x4E0E;&#x5212;&#x5206;&#x7684;&#x3002;</p>
<p> &#x5212;&#x5206;&#x805A;&#x7C7B;&#xFF0C;&#x5373;&#x7C07;&#x7684;&#x96C6;&#x5408;&#x662F;&#x975E;&#x5D4C;&#x5957;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x6070;&#x597D;&#x5728;&#x4E00;&#x4E2A;&#x7EC4;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;K-means&#x3002;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x7684;&#x7C07;&#x96C6;&#x5408;&#x662F;&#x5D4C;&#x5957;&#x7684;&#xFF0C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x6811;&#xFF08;&#x6216;&#x8005;&#x53EB;&#x8C31;&#x7CFB;&#x56FE;&#xFF1F;&#xFF09;&#xFF0C;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x5212;&#x5206;&#x805A;&#x7C7B;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x5212;&#x5206;&#x805A;&#x7C7B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D6;&#x7279;&#x5B9A;&#x5C42;&#x5F97;&#x5230;&#x3002;</p>
</li>
<li><p>&#x4E92;&#x65A5;&#x7684;&#x3001;&#x91CD;&#x53E0;&#x4E0E;&#x6A21;&#x7CCA;&#x7684;&#x3002;</p>
<p> &#x4E92;&#x65A5;&#xFF0C;&#x5373;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x53EA;&#x80FD;&#x6307;&#x6D3E;&#x5230;&#x4E00;&#x4E2A;&#x7C07;&#x4E2D;&#x3002;&#x800C;&#x91CD;&#x53E0;&#x548C;&#x6A21;&#x7CCA;&#x76F8;&#x53CD;&#x3002;&#x91CD;&#x53E0;&#x7684;&#x73B0;&#x5B9E;&#x610F;&#x4E49;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x662F;&#x8001;&#x5E08;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x5B66;&#x751F;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5C06;&#x4ED6;&#x6307;&#x6D3E;&#x5230;&#x4E24;&#x4E2A;&#x7C07;&#x4E2D;&#x3002;&#x800C;&#x6A21;&#x7CCA;&#x5C31;&#x662F;&#x6570;&#x5B66;&#x4E0A;&#x6A21;&#x7CCA;&#x96C6;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x4E0D;&#x662F;&#x4E00;&#x5B9A;&#x5C5E;&#x4E8E;&#x6216;&#x8005;&#x4E0D;&#x5C5E;&#x4E8E;&#x67D0;&#x4E2A;&#x7C07;&#xFF0C;&#x800C;&#x662F;&#x4EE5;&#x4E00;&#x5B9A;&#x7684;&#x6982;&#x7387;&#x5206;&#x914D;&#x7ED9;&#x6BCF;&#x4E2A;&#x7C07;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x8DF5;&#x4E2D;&#x901A;&#x8FC7;&#x5C06;&#x5BF9;&#x8C61;&#x6307;&#x6D3E;&#x5230;&#x6982;&#x7387;&#x6216;&#x8005;&#x8BF4;&#x96B6;&#x5C5E;&#x6743;&#x503C;&#x6700;&#x9AD8;&#x7684;&#x7C07;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x6A21;&#x7CCA;&#x805A;&#x7C7B;&#x4E5F;&#x5C31;&#x8F6C;&#x5316;&#x6210;&#x4E86;&#x4E92;&#x65A5;&#x805A;&#x7C7B;&#x3002;</p>
</li>
<li><p>&#x5B8C;&#x5168;&#x7684;&#x4E0E;&#x90E8;&#x5206;&#x7684;&#x3002;</p>
<p> &#x5B8C;&#x5168;&#x805A;&#x7C7B;&#xFF0C;&#x662F;&#x6307;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x80FD;&#x6307;&#x6D3E;&#x5230;&#x4E00;&#x4E2A;&#x7C07;&#x4E2D;&#xFF0C;&#x800C;&#x90E8;&#x5206;&#x805A;&#x7C7B;&#x76F8;&#x53CD;&#x3002;&#x90E8;&#x5206;&#x805A;&#x7C7B;&#x7684;&#x5B58;&#x5728;&#x662F;&#x56E0;&#x4E3A;&#x4E3A;&#x4E86;&#x820D;&#x5F03;&#x4E00;&#x4E9B;&#x566A;&#x58F0;&#x70B9;&#x3001;&#x79BB;&#x7FA4;&#x70B9;&#x6216;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x70B9;&#x3002;</p>
</li>
</ol>
<p>&#x540C;&#x65F6;&#x7C07;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x662F;&#x591A;&#x6837;&#x7684;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x805A;&#x7C7B;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x7684;&#x7C07;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x7C97;&#x7565;&#x6765;&#x8BF4;&#x7C07;&#x7684;&#x7C7B;&#x578B;&#x5927;&#x81F4;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#xFF1A;&#x660E;&#x663E;&#x5206;&#x79BB;&#x7684;&#xFF0C;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#xFF0C;&#x57FA;&#x4E8E;&#x56FE;&#x7684;&#xFF08;&#x8FDE;&#x901A;&#x5206;&#x652F;&#x3001;&#x57FA;&#x4E8E;&#x90BB;&#x8FD1;&#x7684;&#x7C07;&#xFF09;&#xFF0C;&#x57FA;&#x4E8E;&#x5BC6;&#x5EA6;&#x7684;&#xFF0C;&#x5171;&#x540C;&#x6027;&#x8D28;&#x7684;&#xFF08;&#x6982;&#x5FF5;&#x7C07;&#xFF09;&#x3002;</p>
<h1 id="2k-means"><a name="2k-means" class="plugin-anchor" href="#2k-means"><i class="fa fa-link" aria-hidden="true"></i></a>2.K-means</h1>
<p>Okay&#xFF0C;&#x5E9F;&#x8BDD;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x8BF4;&#x8BF4;&#x5177;&#x4F53;&#x7684;&#x65B9;&#x6CD5;&#x5427;&#xFF0C;&#x5148;&#x4ECE;&#x6700;&#x719F;&#x6089;&#x7684;K-means&#x8BF4;&#x8D77;&#x3002;</p>
<p>K&#x5747;&#x503C;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5927;&#x6982;&#x63CF;&#x8FF0;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li><p>&#x9009;&#x62E9;K&#x4E2A;&#x521D;&#x59CB;&#x8D28;&#x5FC3;&#xFF0C;K&#x662F;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x9009;&#x62E9;&#x7684;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x662F;&#x6240;&#x671F;&#x671B;&#x7684;&#x7C07;&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
</li>
<li><p>&#x6BCF;&#x4E2A;&#x70B9;&#x6307;&#x6D3E;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x8D28;&#x5FC3;&#xFF0C;&#x6307;&#x6D3E;&#x5230;&#x540C;&#x4E00;&#x8D28;&#x5FC3;&#x7684;&#x70B9;&#x5F62;&#x6210;&#x540C;&#x4E00;&#x4E2A;&#x7C07;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x4E0A;&#x4E00;&#x6B65;&#x5F62;&#x6210;&#x7684;&#x6BCF;&#x4E2A;&#x7C07;&#x8BA1;&#x7B97;&#x65B0;&#x7684;&#x8D28;&#x5FC3;&#x3002;</p>
</li>
<li><p>&#x91CD;&#x590D;&#x7B2C;2&#x3001;&#x7B2C;3&#x6B65;&#xFF0C;&#x76F4;&#x5230;&#x7C07;&#x6216;&#x8005;&#x8D28;&#x5FC3;&#x4E0D;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
</li>
</ol>
<p>K&#x5747;&#x503C;&#x603B;&#x662F;&#x4F1A;&#x6536;&#x655B;&#x5230;&#x4E00;&#x4E2A;&#x89E3;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x540C;&#x62C5;&#x5FC3;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6536;&#x655B;&#x901A;&#x5E38;&#x53D1;&#x6210;&#x5728;&#x65E9;&#x671F;&#x9636;&#x6BB5;&#xFF0C;&#x6240;&#x4EE5;&#x653E;&#x5BBD;&#x4E00;&#x4E0B;&#x7B2C;4&#x6B65;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4F8B;&#x5982;&#x53EA;&#x6709;&#x767E;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x70B9;&#x53D1;&#x6210;&#x53D8;&#x5316;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x4E00;&#x6B65;&#x62C6;&#x5F00;&#x8BE6;&#x7EC6;&#x7684;&#x6765;&#x8BF4;&#x3002;</p>
<h2 id="21-&#x9009;&#x62E9;&#x521D;&#x59CB;&#x8D28;&#x5FC3;"><a name="21-&#x9009;&#x62E9;&#x521D;&#x59CB;&#x8D28;&#x5FC3;" class="plugin-anchor" href="#21-&#x9009;&#x62E9;&#x521D;&#x59CB;&#x8D28;&#x5FC3;"><i class="fa fa-link" aria-hidden="true"></i></a>2.1 &#x9009;&#x62E9;&#x521D;&#x59CB;&#x8D28;&#x5FC3;</h2>
<p>K&#x5747;&#x503C;&#x6700;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x521D;&#x59CB;&#x8D28;&#x5FC3;&#x7684;&#x9009;&#x62E9;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E14;&#x67D0;&#x4E9B;&#x7ED3;&#x679C;&#x6548;&#x679C;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x5DEE;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x968F;&#x673A;&#x7684;&#x9009;&#x62E9;&#x8D28;&#x5FC3;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5C31;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x3002;&#x901A;&#x5E38;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x591A;&#x8FD0;&#x884C;&#x51E0;&#x6B21;&#xFF0C;&#x6BCF;&#x6B21;&#x968F;&#x673A;&#x9009;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x521D;&#x59CB;&#x8D28;&#x5FC3;&#xFF0C;&#x7136;&#x540E;&#x6700;&#x540E;&#x9009;&#x62E9;&#x5177;&#x6709;&#x6700;&#x5C0F;SSE&#x7684;&#x7C07;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x867D;&#x7136;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x679C;&#x53EF;&#x80FD;&#x4E00;&#x822C;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4EE5;&#x53CA;&#x7C07;&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5C42;&#x6B21;&#x5316;&#x805A;&#x7C7B;&#x5BF9;&#x4ED6;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#xFF0C;&#x9996;&#x5148;&#x5BF9;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x5C42;&#x6B21;&#x5316;&#x805A;&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x53D6;K&#x4E2A;&#x7C07;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E9B;&#x7C07;&#x7684;&#x8D28;&#x5FC3;&#x6700;&#x4E3A;&#x521D;&#x59CB;&#x8D28;&#x5FC3;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x5F88;&#x6709;&#x6548;&#xFF0C;&#x53EF;&#x662F;&#x611F;&#x89C9;&#x5F88;&#x7F57;&#x55E6;&#x6709;&#x6CA1;&#x6709;&#xFF1F;&#x4ED6;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x4E8E;&#x6837;&#x672C;&#x8F83;&#x5C0F;&#xFF0C;&#x800C;&#x4E14;K&#x76F8;&#x5BF9;&#x4E8E;&#x6837;&#x672C;&#x5927;&#x5C0F;&#x8F83;&#x5C0F;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5C42;&#x6B21;&#x5316;&#x805A;&#x7C7B;&#x5DF2;&#x7ECF;&#x5F88;&#x7E41;&#x7410;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x5C42;&#x6B21;&#x5316;&#x805A;&#x7C7B;&#x5DF2;&#x6709;&#x7684;&#x7ED3;&#x679C;&#x62FF;&#x6765;&#x518D;&#x805A;&#x7C7B;&#xFF0C;&#x611F;&#x89C9;&#x4E0D;&#x600E;&#x4E48;&#x5B9E;&#x7528;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x9996;&#x5148;&#x968F;&#x673A;&#x7684;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x70B9;&#xFF08;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6837;&#x672C;&#x7684;&#x5747;&#x503C;&#x4F5C;&#x4E3A;&#x8D28;&#x5FC3;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6BCF;&#x4E2A;&#x540E;&#x7EED;&#x7684;&#x521D;&#x59CB;&#x8D28;&#x5FC3;&#xFF0C;&#x9009;&#x62E9;&#x79BB;&#x9009;&#x53D6;&#x8FC7;&#x7684;&#x8D28;&#x5FC3;&#x6700;&#x8FDC;&#x7684;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x786E;&#x4FDD;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x521D;&#x59CB;&#x8D28;&#x5FC3;&#x662F;&#x6563;&#x5F00;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x8FD9;&#x6837;&#x5F88;&#x53EF;&#x80FD;&#x9009;&#x53D6;&#x5230;&#x79BB;&#x7FA4;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x8BA1;&#x7B97;&#x8DDD;&#x79BB;&#x6700;&#x8FDC;&#x70B9;&#x7684;&#x5F00;&#x9500;&#x4E5F;&#x5F88;&#x5927;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x662F;K-means&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x4E8C;&#x5206;K-means&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD8;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x540E;&#x5904;&#x7406;&#x6765;&#x4FEE;&#x8865;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x7C07;&#x96C6;&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x653E;&#x5230;&#x540E;&#x9762;&#x4ECB;&#x7ECD;&#x3002;</p>
<h2 id="22-&#x6307;&#x6D3E;&#x70B9;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x8D28;&#x5FC3;"><a name="22-&#x6307;&#x6D3E;&#x70B9;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x8D28;&#x5FC3;" class="plugin-anchor" href="#22-&#x6307;&#x6D3E;&#x70B9;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x8D28;&#x5FC3;"><i class="fa fa-link" aria-hidden="true"></i></a>2.2 &#x6307;&#x6D3E;&#x70B9;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x8D28;&#x5FC3;</h2>
<p>&#x5BF9;&#x4E8E;&#x6B27;&#x5F0F;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8DDD;&#x79BB;&#xFF08;<span class="katex"><span class="katex-mathml"><math><semantics><mrow><msub><mi>L</mi><mn>2</mn></msub></mrow><annotation encoding="application/x-tex">L_2</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.68333em;"></span><span class="strut bottom" style="height:0.83333em;vertical-align:-0.15em;"></span><span class="base textstyle uncramped"><span class="mord"><span class="mord mathit">L</span><span class="msupsub"><span class="vlist"><span style="top:0.15em;margin-right:0.05em;margin-left:0em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle cramped mtight"><span class="mord mathrm mtight">2</span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span></span></span></span></span>&#xFF09;&#x8BA1;&#x7B97;&#xFF0C;&#x5BF9;&#x4E8E;&#x6587;&#x6863;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4F59;&#x5F26;&#x76F8;&#x4F3C;&#x6027;&#x8BA1;&#x7B97;&#xFF0C;&#x901A;&#x5E38;&#x8FD8;&#x6709;&#x4F8B;&#x5982;&#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB;&#xFF08;<span class="katex"><span class="katex-mathml"><math><semantics><mrow><msub><mi>L</mi><mn>1</mn></msub></mrow><annotation encoding="application/x-tex">L_1</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.68333em;"></span><span class="strut bottom" style="height:0.83333em;vertical-align:-0.15em;"></span><span class="base textstyle uncramped"><span class="mord"><span class="mord mathit">L</span><span class="msupsub"><span class="vlist"><span style="top:0.15em;margin-right:0.05em;margin-left:0em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle cramped mtight"><span class="mord mathrm mtight">1</span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span></span></span></span></span>&#xFF09;&#x548C;Jaccard&#x5EA6;&#x91CF;&#x3002;</p>
<p>K&#x5747;&#x503C;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5EA6;&#x91CF;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5EA6;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x7B97;&#x6CD5;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x8981;&#x91CD;&#x590D;&#x7684;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x70B9;&#x7684;&#x4E0E;&#x8D28;&#x5FC3;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x3002;&#x8FD8;&#x6709;&#x4F8B;&#x5982;&#x4E8C;&#x5206;K&#x5747;&#x503C;&#x901A;&#x8FC7;&#x51CF;&#x5C11;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x91CF;&#x6765;&#x52A0;&#x5FEB;K&#x5747;&#x503C;&#x901F;&#x5EA6;&#x3002;</p>
<h2 id="23&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x8D28;&#x5FC3;"><a name="23&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x8D28;&#x5FC3;" class="plugin-anchor" href="#23&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x8D28;&#x5FC3;"><i class="fa fa-link" aria-hidden="true"></i></a>2.3&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x8D28;&#x5FC3;</h2>
<p>&#x805A;&#x7C7B;&#x7684;&#x76EE;&#x6807;&#x901A;&#x5E38;&#x7528;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x8868;&#x793A;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x4E8E;&#x70B9;&#x4E4B;&#x95F4;&#xFF0C;&#x6216;&#x8005;&#x70B9;&#x5230;&#x8D28;&#x5FC3;&#x7684;&#x90BB;&#x8FD1;&#x6027;&#x3002;&#x5BF9;&#x4E8E;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x4F7F;&#x7528;&#x8BEF;&#x5DEE;&#x5E73;&#x65B9;&#x548C;&#xFF08;SSE&#xFF09;&#x6765;&#x4F5C;&#x4E3A;&#x5EA6;&#x91CF;&#x805A;&#x7C7B;&#x8D28;&#x91CF;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x3002;SSE&#x4E5F;&#x6210;&#x4E3A;&#x6563;&#x5E03;&#x3002;&#x4F7F;&#x5F97;SSE&#x6700;&#x5C0F;&#x7684;&#x8D28;&#x5FC3;&#x662F;&#x5747;&#x503C;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x6863;&#x6570;&#x636E;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4F59;&#x5F26;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x4E5F;&#x79F0;&#x4F5C;&#x7C07;&#x7684;&#x51DD;&#x805A;&#x5EA6;&#x3002;&#x5176;&#x6700;&#x4F18;&#x89E3;&#x4E5F;&#x662F;&#x5747;&#x503C;&#x3002;&#x800C;&#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB;&#x4F5C;&#x4E3A;&#x5EA6;&#x91CF;&#x7684;&#x8BDD;&#xFF0C;&#x6700;&#x4F18;&#x8D28;&#x5FC3;&#x662F;&#x4E2D;&#x4F4D;&#x6570;&#x3002;&#x800C;&#x4E0A;&#x9762;&#x8BF4;&#x5230;&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8DDD;&#x79BB;&#x4EE5;&#x53CA;&#x4F59;&#x5F26;&#x76F8;&#x4F3C;&#x5EA6;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;Bregman&#x6563;&#x5EA6;&#x7684;&#x7279;&#x4F8B;&#xFF0C;Bregman&#x6563;&#x5EA6;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x90FD;&#x662F;&#x5747;&#x503C;&#x3002;</p>
<h2 id="24&#x5176;&#x4ED6;&#x95EE;&#x9898;"><a name="24&#x5176;&#x4ED6;&#x95EE;&#x9898;" class="plugin-anchor" href="#24&#x5176;&#x4ED6;&#x95EE;&#x9898;"><i class="fa fa-link" aria-hidden="true"></i></a>2.4&#x5176;&#x4ED6;&#x95EE;&#x9898;</h2>
<ol>
<li><p>&#x7A7A;&#x7C07;&#x95EE;&#x9898;</p>
<p> K&#x5747;&#x503C;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x7A7A;&#x7C07;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x53EF;&#x80FD;&#x6240;&#x6709;&#x70B9;&#x90FD;&#x6CA1;&#x6709;&#x6307;&#x6D3E;&#x5230;&#x67D0;&#x4E2A;&#x7C07;&#x5185;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x66FF;&#x8865;&#x8D28;&#x5FC3;&#xFF0C;&#x5426;&#x5219;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x4F1A;&#x52A0;&#x5927;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8DDD;&#x79BB;&#x5F53;&#x524D;&#x4EFB;&#x4F55;&#x8D28;&#x5FC3;&#x6700;&#x8FDC;&#x7684;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x5177;&#x6709;&#x6700;&#x5927;SSE&#x7C07;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x66FF;&#x8865;&#x8D28;&#x5FC3;&#x3002;</p>
</li>
<li><p>&#x79BB;&#x7FA4;&#x70B9;</p>
<p> &#x4F7F;&#x7528;SSE&#x6807;&#x51C6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x79BB;&#x7FA4;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x8FC7;&#x5EA6;&#x5F71;&#x54CD;&#x6240;&#x53D1;&#x73B0;&#x7684;&#x7C07;&#xFF0C;&#x6240;&#x5F97;&#x5230;&#x7684;&#x8D28;&#x5FC3;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x6709;&#x4EE3;&#x8868;&#x6027;&#xFF0C;&#x63D0;&#x524D;&#x5220;&#x9664;&#x4ED6;&#x4EEC;&#x662F;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x7136;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x4E0D;&#x80FD;&#x5220;&#x9664;&#x79BB;&#x7FA4;&#x70B9;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x79BB;&#x7FA4;&#x70B9;&#x53EF;&#x80FD;&#x662F;&#x4EBA;&#x4EEC;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x70B9;&#x3002;</p>
<p> &#x90A3;&#x4E48;&#x5982;&#x4F55;&#x8BC6;&#x522B;&#x79BB;&#x7FA4;&#x70B9;&#x5462;&#xFF1F;&#x63D0;&#x524D;&#x5220;&#x9664;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x4F55;&#x63D0;&#x524D;&#x68C0;&#x6D4B;&#x5728;<a href="www.baidu.com">&#x540E;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4F1A;&#x8BF4;&#x5230;</a>&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x540E;&#x5904;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x53EF;&#x4EE5;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x70B9;&#x5BF9;SSE&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5220;&#x9664;&#x90A3;&#x4E9B;&#x5177;&#x6709;&#x5F02;&#x4E4E;&#x5BFB;&#x5E38;&#x7684;&#x5F71;&#x54CD;&#x70B9;&#xFF0C;&#x6B64;&#x5916;&#x8FD8;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x90A3;&#x4E9B;&#x5F88;&#x5C0F;&#x7684;&#x7C07;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5E38;&#x5E38;&#x4EE3;&#x8868;&#x79BB;&#x7FA4;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x540E;&#x5904;&#x7406;&#x65B9;&#x6CD5;</p>
<p> &#x4E00;&#x79CD;&#x660E;&#x663E;&#x964D;&#x4F4E;SSE&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x8F83;&#x5927;&#x7684;K&#xFF0C;&#x7136;&#x800C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x53EA;&#x60F3;&#x964D;&#x4F4E;SSE&#xFF0C;&#x800C;&#x4E0D;&#x5E0C;&#x671B;&#x589E;&#x52A0;&#x7C07;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4EA4;&#x66FF;&#x7684;&#x4F7F;&#x7528;&#x7C07;&#x5206;&#x88C2;&#x548C;&#x7C07;&#x5408;&#x5E76;&#x3002;</p>
<p> &#x589E;&#x52A0;&#x7C07;&#x4E2A;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#xFF08;&#x5206;&#x88C2;&#xFF09;&#xFF1A;&#x5206;&#x88C2;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x8F83;&#x5927;SSE&#x7684;&#x7C07;&#x6216;&#x8005;&#x5206;&#x88C2;&#x5728;&#x7279;&#x5B9A;&#x5C5E;&#x6027;&#x4E0A;&#x5177;&#x6709;&#x6700;&#x5927;&#x6807;&#x51C6;&#x5DEE;&#x7684;&#x7C07;&#xFF1B;&#x5F15;&#x8FDB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8D28;&#x70B9;&#xFF0C;&#x901A;&#x5E38;&#x9009;&#x62E9;&#x79BB;&#x6240;&#x6709;&#x7C07;&#x8D28;&#x5FC3;&#x6700;&#x8FDC;&#x7684;&#x70B9;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4ECE;&#x6240;&#x6709;&#x7684;&#x70B9;&#x6216;&#x8005;&#x5177;&#x6709;&#x6700;&#x9AD8;SSE&#x7684;&#x70B9;&#x4E2D;&#x968F;&#x673A;&#x9009;&#x62E9;&#x3002;</p>
<p> &#x51CF;&#x5C11;&#x7C07;&#x4E2A;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#xFF08;&#x5408;&#x5E76;&#xFF09;&#xFF1A;&#x62C6;&#x6563;&#x4E00;&#x4E2A;&#x7C07;&#xFF0C;&#x5220;&#x9664;&#x7C07;&#x5BF9;&#x5E94;&#x7684;&#x8D28;&#x5FC3;&#xFF0C;&#x7C07;&#x4E2D;&#x7684;&#x70B9;&#x91CD;&#x65B0;&#x6307;&#x6D3E;&#x5230;&#x5176;&#x4ED6;&#x7C07;&#x4E2D;&#xFF1B;&#x5408;&#x5E76;&#x4E24;&#x4E2A;&#x7C07;&#xFF0C;&#x901A;&#x5E38;&#x9009;&#x62E9;&#x8D28;&#x5FC3;&#x8DDD;&#x79BB;&#x6700;&#x8FD1;&#x7684;&#x4E24;&#x4E2A;&#x7C07;&#xFF08;&#x8D28;&#x5FC3;&#x6CD5;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x9009;&#x62E9;&#x5408;&#x5E76;&#x540E;&#x5BFC;&#x81F4;&#x603B;SSE&#x589E;&#x52A0;&#x6700;&#x5C11;&#x7684;&#x7C07;&#xFF08;Ward&#x6CD5;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x589E;&#x91CF;&#x5730;&#x66F4;&#x65B0;&#x8D28;&#x5FC3;</p>
<p> &#x53EF;&#x4EE5;&#x5728;&#x70B9;&#x5230;&#x7C07;&#x7684;&#x6BCF;&#x6B21;&#x6307;&#x6D3E;&#x4E4B;&#x540E;&#xFF0C;&#x589E;&#x91CF;&#x7684;&#x66F4;&#x65B0;&#x8D28;&#x5FC3;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6240;&#x6709;&#x70B9;&#x90FD;&#x6307;&#x6D3E;&#x5230;&#x7C07;&#x4E2D;&#x4E4B;&#x540E;&#x518D;&#x66F4;&#x65B0;&#x3002;&#x8FD9;&#x6837;&#x8FD8;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x7A7A;&#x7C07;&#xFF08;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x7C07;&#x90FD;&#x662F;&#x4ECE;&#x5355;&#x4E2A;&#x70B9;&#x5F00;&#x59CB;&#xFF09;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x589E;&#x91CF;&#x66F4;&#x65B0;&#x8FD8;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x70B9;&#x7684;&#x76F8;&#x5BF9;&#x6743;&#x503C;&#xFF0C;&#x589E;&#x52A0;&#x51C6;&#x786E;&#x7387;&#x548C;&#x6536;&#x655B;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x901A;&#x5E38;&#x76F8;&#x5F53;&#x56F0;&#x96BE;&#xFF08;&#x7C7B;&#x4F3C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x7684;&#x6743;&#x503C;&#xFF09;&#x3002;&#x7F3A;&#x70B9;&#x65B9;&#x9762;&#x662F;&#xFF0C;&#x589E;&#x91CF;&#x5730;&#x66F4;&#x65B0;&#x8D28;&#x5FC3;&#x80AF;&#x80FD;&#x5BFC;&#x81F4;&#x6B21;&#x5E8F;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x8BA1;&#x7B97;&#x91CF;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;</p>
</li>
</ol>
<h2 id="25-&#x4E8C;&#x5206;k&#x5747;&#x503C;"><a name="25-&#x4E8C;&#x5206;k&#x5747;&#x503C;" class="plugin-anchor" href="#25-&#x4E8C;&#x5206;k&#x5747;&#x503C;"><i class="fa fa-link" aria-hidden="true"></i></a>2.5 &#x4E8C;&#x5206;K&#x5747;&#x503C;</h2>
<p>&#x4E8C;&#x5206;K&#x5747;&#x503C;&#x7684;&#x601D;&#x60F3;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4E3A;&#x4E86;&#x5F97;&#x5230;K&#x7684;&#x7C07;&#xFF0C;&#x9996;&#x5148;&#x5C06;&#x6240;&#x6709;&#x7684;&#x7C07;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x7C07;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E2D;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x7C07;&#x8FDB;&#x884C;&#x4E8C;&#x5206;&#x88C2;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4ECE;&#x6240;&#x6709;&#x7684;&#x7C07;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8FDB;&#x884C;&#x4E8C;&#x5206;&#x88C2;&#xFF0C;&#x77E5;&#x9053;&#x751F;&#x6210;K&#x4E2A;&#x7C07;&#x3002;</p>
<p>&#x5F85;&#x5206;&#x88C2;&#x7C07;&#x7684;&#x9009;&#x62E9;&#x6709;&#x8BB8;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x9009;&#x62E9;&#x6700;&#x5927;&#x7684;&#x7C07;&#xFF0C;&#x6216;&#x8005;&#x9009;&#x62E9;&#x5177;&#x6709;&#x6700;&#x5927;SSE&#x7684;&#x7C07;&#xFF0C;&#x6216;&#x8005;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x5927;&#x5C0F;&#x548C;SSE&#x7684;&#x7EFC;&#x5408;&#x6307;&#x6807;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x3002;K&#x5747;&#x503C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4F7F;&#x603B;SSE&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x7684;&#x805A;&#x7C7B;&#xFF0C;&#x800C;&#x4E8C;&#x5206;K&#x5747;&#x503C;&#x662F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x662F;&#x5C40;&#x90E8;&#x7684;&#x4F7F;&#x7528;&#x4E86;K&#x5747;&#x503C;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x524D;&#x9762;&#x4E5F;&#x63D0;&#x5230;&#x8FC7;&#x4E86;&#xFF0C;&#x4E8C;&#x5206;K&#x5747;&#x503C;&#x7684;&#x6709;&#x70B9;&#x5C31;&#x662F;&#x4E0D;&#x4F1A;&#x53D7;&#x521D;&#x59CB;&#x503C;&#x9009;&#x5B9A;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x4E14;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x3002;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x662F;&#x4F7F;&#x7528;&#x5DF2;&#x7ECF;&#x805A;&#x7C7B;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x7C07;&#x4F5C;&#x4E3A;&#x57FA;&#x672C;K&#x5747;&#x503C;&#x7684;&#x8D28;&#x5FC3;&#xFF0C;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x9010;&#x6B65;&#x6C42;&#x7CBE;&#x3002;</p>
<h2 id="26-k&#x5747;&#x503C;&#x7684;&#x9002;&#x7528;&#x7C07;&#x7C7B;&#x578B;"><a name="26-k&#x5747;&#x503C;&#x7684;&#x9002;&#x7528;&#x7C07;&#x7C7B;&#x578B;" class="plugin-anchor" href="#26-k&#x5747;&#x503C;&#x7684;&#x9002;&#x7528;&#x7C07;&#x7C7B;&#x578B;"><i class="fa fa-link" aria-hidden="true"></i></a>2.6 K&#x5747;&#x503C;&#x7684;&#x9002;&#x7528;&#x7C07;&#x7C7B;&#x578B;</h2>
<p>&#x524D;&#x9762;&#x8BF4;&#x8FC7;&#x7C07;&#x7684;&#x7C7B;&#x578B;&#x5206;&#x4E3A;&#x5F88;&#x591A;&#x79CD;&#xFF0C;K&#x5747;&#x503C;&#x5BF9;&#x4E8E;&#x975E;&#x7403;&#x5F62;&#x5F62;&#x72B6;&#x6216;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x6216;&#x5BC6;&#x5EA6;&#x7684;&#x7C07;&#x65F6;&#xFF0C;&#x5F88;&#x96BE;&#x68C0;&#x6D4B;&#x5230;&#x201C;&#x81EA;&#x7136;&#x7684;&#x201D;&#x7C07;&#x3002;K&#x5747;&#x503C;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x7B49;&#x5C3A;&#x5BF8;&#x548C;&#x7B49;&#x5BC6;&#x5EA6;&#x7684;&#x7403;&#x5F62;&#x7C07;&#xFF0C;&#x6216;&#x8005;&#x660E;&#x663E;&#x5206;&#x79BB;&#x7684;&#x7C07;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x5C06;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x7C07;&#x5206;&#x5272;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x5B50;&#x7C07;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C40;&#x9650;&#x6027;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x514B;&#x670D;&#x3002;</p>
<h2 id="27-k-means&#x4F18;&#x7F3A;&#x70B9;"><a name="27-k-means&#x4F18;&#x7F3A;&#x70B9;" class="plugin-anchor" href="#27-k-means&#x4F18;&#x7F3A;&#x70B9;"><i class="fa fa-link" aria-hidden="true"></i></a>2.7 K-means&#x4F18;&#x7F3A;&#x70B9;</h2>
<p>K&#x5747;&#x503C;&#x7B80;&#x5355;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x76F8;&#x5F53;&#x6709;&#x6548;&#xFF08;&#x6BD5;&#x7ADF;&#x662F;&#x6700;&#x53E4;&#x8001;&#x6700;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x805A;&#x7C7B;&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x800C;&#x4E14;K&#x5747;&#x503C;&#x7684;&#x67D0;&#x4E9B;&#x53D8;&#x79CD;&#x751A;&#x81F3;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x3002;K&#x5747;&#x503C;&#x4E0D;&#x9002;&#x5408;&#x5904;&#x7406;&#x90A3;&#x4E9B;&#x975E;&#x7403;&#x5F62;&#x7C07;&#x3001;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x3001;&#x4E0D;&#x540C;&#x5BC6;&#x5EA6;&#x7684;&#x7C07;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x5305;&#x542B;&#x79BB;&#x7FA4;&#x70B9;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#x662F;&#xFF0C;K&#x5747;&#x503C;&#x4E5F;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;</p>
<h1 id="3&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;"><a name="3&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;" class="plugin-anchor" href="#3&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;"><i class="fa fa-link" aria-hidden="true"></i></a>3.&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;</h1>
<p>&#x591A;&#x5143;&#x5B66;&#x8FC7;&#x7CFB;&#x7EDF;&#x805A;&#x7C7B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x3002;</p>
<p>&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x901A;&#x5E38;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF1A;&#x51DD;&#x805A;&#x7684;&#xFF0C;&#x4ECE;&#x70B9;&#x4F5C;&#x4E3A;&#x4E2A;&#x4F53;&#x7C07;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x5408;&#x5E76;&#x4E24;&#x4E2A;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x7C07;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x70B9;&#x5408;&#x5E76;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x7C07;&#xFF1B;&#x5206;&#x88C2;&#x7684;&#xFF0C;&#x4ECE;&#x5305;&#x542B;&#x6240;&#x6709;&#x70B9;&#x7684;&#x7C07;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x5206;&#x88C2;&#x4E00;&#x4E2A;&#x7C07;&#xFF0C;&#x76F4;&#x5230;&#x4EC5;&#x5269;&#x4E0B;&#x5355;&#x70B9;&#x7C07;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5148;&#x8BF4;&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x3002;&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x6811;&#x72B6;&#x56FE;&#xFF08;&#x8C31;&#x7CFB;&#x56FE;&#xFF09;&#x663E;&#x793A;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E8C;&#x7EF4;&#x70B9;&#x7684;&#x96C6;&#x5408;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5D4C;&#x5957;&#x56FE;&#x8868;&#x793A;&#x3002;</p>
<h2 id="31-&#x57FA;&#x672C;&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;"><a name="31-&#x57FA;&#x672C;&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;" class="plugin-anchor" href="#31-&#x57FA;&#x672C;&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;"><i class="fa fa-link" aria-hidden="true"></i></a>3.1 &#x57FA;&#x672C;&#x51DD;&#x805A;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;</h2>
<p>&#x4ECE;&#x4E2A;&#x4F53;&#x70B9;&#x4F5C;&#x4E3A;&#x7C07;&#x5F00;&#x59CB;&#xFF0C;&#x4E00;&#x6B21;&#x5408;&#x5E76;&#x4E24;&#x4E2A;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x7C07;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x53EA;&#x5269;&#x4E0B;&#x4E00;&#x4E2A;&#x7C07;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x7C07;&#x4E4B;&#x95F4;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x3002;&#x7CFB;&#x7EDF;&#x805A;&#x7C7B;&#x91CC;&#x9762;&#x8BF4;&#x4E86;8&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x4E00;&#x4E0B;&#x5176;&#x4E2D;&#x4E09;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#xFF1A;</p>
<ol>
<li><p>&#x6700;&#x957F;&#x8DDD;&#x79BB;&#x6CD5;&#xFF08;MAX&#xFF0C;&#x5168;&#x94FE;&#xFF09;&#x5229;&#x7528;&#x4E24;&#x4E2A;&#x7C07;&#x4E2D;&#x4E24;&#x4E2A;&#x6700;&#x8FDC;&#x7684;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x4F5C;&#x4E3A;&#x7C07;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#xFF0C;&#x5373;&#x4E0D;&#x540C;&#x7ED3;&#x70B9;&#x5B50;&#x96C6;&#x4E2D;&#x4E24;&#x4E2A;&#x7ED3;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6700;&#x957F;&#x8FB9;&#x3002;&#x5B8C;&#x5168;&#x94FE;&#x63A5;&#x5BF9;&#x4E8E;&#x566A;&#x58F0;&#x70B9;&#x548C;&#x79BB;&#x7FA4;&#x70B9;&#x4E0D;&#x592A;&#x654F;&#x611F;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x5927;&#x7684;&#x7C07;&#x7834;&#x88C2;&#xFF0C;&#x5E76;&#x4E14;&#x504F;&#x597D;&#x7403;&#x5F62;&#x7C07;(&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x540E;&#x4E24;&#x6761;&#xFF0C;&#x6709;&#x9AD8;&#x89C1;&#x7684;&#x540C;&#x5B66;&#x8BF7;&#x5E2E;&#x7406;&#x89E3;&#x4E00;&#x4E0B;)&#x3002;</p>
</li>
<li><p>&#x6700;&#x77ED;&#x8DDD;&#x79BB;&#x6CD5;&#xFF08;MIN&#xFF0C;&#x5355;&#x94FE;&#xFF09;&#x5B9A;&#x4E49;&#x7C07;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x4E3A;&#x4E24;&#x4E2A;&#x7C07;&#x4E2D;&#x8DDD;&#x79BB;&#x6700;&#x8FD1;&#x7684;&#x4E24;&#x4E2A;&#x70B9;&#x4E4B;&#x524D;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x3002;&#x5355;&#x94FE;&#x6280;&#x672F;&#x64C5;&#x957F;&#x5904;&#x7406;&#x975E;&#x692D;&#x5706;&#x5F62;&#x7684;&#x7C07;&#xFF0C;&#x5BF9;&#x566A;&#x58F0;&#x548C;&#x79BB;&#x7FA4;&#x70B9;&#x5F88;&#x654F;&#x611F;&#x3002;</p>
</li>
<li><p>&#x5E73;&#x5747;&#x8DDD;&#x79BB;&#x6CD5;&#xFF08;&#x7EC4;&#x5E73;&#x5747;&#xFF0C;group average&#xFF09;&#x5B9A;&#x4E49;&#x7C07;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x4E3A;&#x4E0D;&#x540C;&#x7C07;&#x6240;&#x6709;&#x70B9;&#x5BF9;&#x90BB;&#x8FD1;&#x5EA6;&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002;</p>
</li>
<li><p>&#x6B64;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x7C07;&#x7528;&#x8D28;&#x5FC3;&#x4EE3;&#x8868;&#xFF0C;&#x4F7F;&#x7528;&#x8D28;&#x5FC3;&#x4E4B;&#x95F4;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x4F5C;&#x4E3A;&#x7C07;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x3002;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;&#x8D28;&#x5FC3;&#x6CD5;&#xFF0C;&#x8D28;&#x5FC3;&#x6CD5;&#x770B;&#x4E0A;&#x53BB;K&#x5747;&#x503C;&#x76F8;&#x4F3C;&#xFF0C;&#x5176;&#x5B9E;&#x66F4;&#x76F8;&#x4F3C;&#x7684;&#x662F;&#x4E0B;&#x9762;&#x7684;Ward&#x6CD5;&#xFF0C;&#x8D28;&#x5FC3;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#xFF1A;&#x5012;&#x7F6E;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5373;&#x88AB;&#x5408;&#x5E76;&#x7684;&#x7C07;&#x53EF;&#x80FD;&#x6BD4;&#x524D;&#x4E00;&#x6B65;&#x5408;&#x5E76;&#x7684;&#x7C07;&#x66F4;&#x52A0;&#x76F8;&#x4F3C;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x88AB;&#x5408;&#x5E76;&#x7684;&#x7C07;&#x4E4B;&#x95F4;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x968F;&#x7740;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x7684;&#x8FDB;&#x5C55;&#x5355;&#x8C03;&#x7684;&#x589E;&#x52A0;&#xFF08;&#x6216;&#x8005;&#x4E0D;&#x589E;&#x52A0;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x79CD;&#x7279;&#x6027;&#x901A;&#x5E38;&#x88AB;&#x89C6;&#x4F5C;&#x4E00;&#x79CD;&#x7F3A;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x53E6;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x65B9;&#x6CD5;&#x662F;Ward&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x5408;&#x5E76;&#x4E24;&#x4E2A;&#x7C07;&#x5BFC;&#x81F4;&#x7684;SSE&#x589E;&#x52A0;&#x6765;&#x5EA6;&#x91CF;&#x4E24;&#x4E2A;&#x7C07;&#x4E4B;&#x95F4;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x4E0E;K&#x5747;&#x503C;&#x4F7F;&#x7528;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x76F8;&#x540C;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x90BB;&#x8FD1;&#x5EA6;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x8DDD;&#x79BB;&#x7684;&#x5E73;&#x65B9;&#x8BA1;&#x7B97;&#x65F6;&#xFF0C;Ward&#x65B9;&#x6CD5;&#x4E0E;&#x7EC4;&#x5E73;&#x5747;&#x6CD5;&#x5341;&#x5206;&#x76F8;&#x4F3C;&#x3002;</p>
</li>
</ol>
<h2 id="32-&#x4F18;&#x7F3A;&#x70B9;"><a name="32-&#x4F18;&#x7F3A;&#x70B9;" class="plugin-anchor" href="#32-&#x4F18;&#x7F3A;&#x70B9;"><i class="fa fa-link" aria-hidden="true"></i></a>3.2 &#x4F18;&#x7F3A;&#x70B9;</h2>
<p>&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x6B63;&#x662F;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x6240;&#x9700;&#x8981;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x4E14;&#x67D0;&#x4E9B;&#x7814;&#x7A76;&#x8868;&#x660E;&#xFF08;...&#x4E66;&#x4E2D;&#x539F;&#x8BDD;&#xFF0C;&#x611F;&#x89C9;&#x5341;&#x5206;&#x4E0D;&#x9760;&#x8C31;&#xFF09;&#xFF0C;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x805A;&#x7C7B;&#x3002;</p>
<p>&#x7F3A;&#x70B9;&#x6765;&#x6765;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x5217;&#x51FA;&#x6765;&#xFF1A;</p>
<ol>
<li><p>&#x7F3A;&#x4E4F;&#x5168;&#x5C40;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x3002;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x5728;&#x6BCF;&#x4E00;&#x6B65;&#x5C40;&#x90E8;&#x7684;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x6807;&#x51C6;&#x6765;&#x51B3;&#x5B9A;&#x54EA;&#x4E9B;&#x7C07;&#x5E94;&#x5F53;&#x5408;&#x5E76;&#xFF0C;&#x4E0D;&#x80FD;&#x5168;&#x5C40;&#x4F18;&#x5316;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x4EE5;&#x5288;&#x5F00;&#x89E3;&#x51B3;&#x56F0;&#x96BE;&#x7684;&#x7EC4;&#x5408;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x89E3;&#x51B3;&#x4E86;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x521D;&#x59CB;&#x70B9;&#x7684;&#x9009;&#x62E9;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p>&#x5408;&#x5E76;&#x662F;&#x6700;&#x7EC8;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x4E24;&#x4E2A;&#x7C07;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x5C31;&#x4E0D;&#x80FD;&#x64A4;&#x6D88;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x963B;&#x788D;&#x4E86;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x53D8;&#x6210;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;Ward&#x8FD8;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x521D;&#x59CB;&#x5316;K&#x5747;&#x503C;&#x805A;&#x7C7B;&#x7684;&#x9C81;&#x68D2;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF1A;&#x79FB;&#x52A8;&#x6811;&#x7684;&#x5206;&#x652F;&#x4EE5;&#x6539;&#x5584;&#x5168;&#x5C40;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x5212;&#x5206;&#x805A;&#x7C7B;&#x6280;&#x672F;&#xFF08;K&#x5747;&#x503C;&#xFF09;&#x6765;&#x521B;&#x5EFA;&#x8BB8;&#x591A;&#x5C0F;&#x7C07;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x8FD9;&#x4E9B;&#x5C0F;&#x7C07;&#x51FA;&#x53D1;&#x8FDB;&#x884C;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x3002;</p>
</li>
<li><p>&#x8BA1;&#x7B97;&#x91CF;&#x4E0E;&#x5B58;&#x50A8;&#x91CF;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x6602;&#x8D35;&#x7684;&#x3002;&#x5C42;&#x6B21;&#x5316;&#x805A;&#x7C7B;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x8DDD;&#x79BB;&#x77E9;&#x9635;&#xFF08;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x624B;&#x52A8;&#x8BA1;&#x7B97;...&#x7B80;&#x76F4;&#x60E8;&#x65E0;&#x4EBA;&#x9053;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x5B58;&#x50A8;&#x8FD9;&#x4E2A;&#x8DDD;&#x79BB;&#x77E9;&#x9635;&#xFF0C;&#x6240;&#x4EE5;&#x9762;&#x5BF9;&#x6570;&#x636E;&#x91CF;&#x8F83;&#x5927;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C42;&#x6B21;&#x5316;&#x805A;&#x7C7B;&#x901A;&#x5E38;&#x662F;&#x4E4F;&#x529B;&#x7684;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;&#x566A;&#x58F0;&#x3001;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#x5DEE;&#x3002;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x5408;&#x5E76;&#x90FD;&#x662F;&#x6700;&#x7EC8;&#x7684;&#x3002;</p>
</li>
</ol>
<p>&#x5BF9;&#x4E8E;2&#x3001;3&#x3001;4&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;K&#x5747;&#x503C;&#x8FDB;&#x884C;&#x90E8;&#x5206;&#x805A;&#x7C7B;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h1 id="4dbscan"><a name="4dbscan" class="plugin-anchor" href="#4dbscan"><i class="fa fa-link" aria-hidden="true"></i></a>4.DBSCAN</h1>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Niu 2015 ~ 2018 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">Update Time:
2018-05-22 20:50:34
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="guan-lian-fen-xi.html" class="navigation navigation-prev " aria-label="Previous page: 关联分析">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="fen-lei-1-0.html" class="navigation navigation-next " aria-label="Next page: 分类1.0">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"聚类分析","level":"1.3.3","depth":2,"next":{"title":"分类1.0","level":"1.3.4","depth":2,"path":"shu-ju-wa-jue-dao-lun/fen-lei-1-0.md","ref":"shu-ju-wa-jue-dao-lun/fen-lei-1-0.md","articles":[]},"previous":{"title":"关联分析","level":"1.3.2","depth":2,"path":"shu-ju-wa-jue-dao-lun/guan-lian-fen-xi.md","ref":"shu-ju-wa-jue-dao-lun/guan-lian-fen-xi.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-highlight","-sharing","search-plus@^0.0.11","prism@^2.1.0","prism-themes@^0.0.2","anchors@^0.7.1","include-codeblock@^3.0.2","ace@^0.3.2","katex@^1.1.3","splitter@^0.0.8","tbfed-pagefooter@^0.0.1","expandable-chapters-small@^0.1.7","favicon@^0.0.2"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © Niu 2015 ~ 2018","modify_label":"Update Time:","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-base16-ateliersulphurpool.light.css"]},"ace":{},"splitter":{},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{},"prism-themes":{},"expandable-chapters-small":{},"include-codeblock":{"check":false,"edit":true,"fixlang":false,"lang":"","template":"ace","theme":"chrome","unindent":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"anchors":{},"search-plus":{}},"theme":"default","author":"Kitty","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Notes","language":"zh-hans","links":{"sidebar":{"Return to Blog":"http://www.norris-niu.top"}},"gitbook":"3.2.3","description":"Kitty's Notes"},"file":{"path":"shu-ju-wa-jue-dao-lun/ju-lei-fen-xi.md","mtime":"2018-05-22T12:50:34.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-12T09:38:04.747Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ace/ace/ace.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ace/ace.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

